[
  {
    "day": 1,
    "summary": "The first executive order signed by Trump aimed to repeal former President Obama's health care law. More than 200,000 King County residents are insured through the Affordable Care Act.",
    "link": "Read more about how a repeal would affect local residents.",
    "url": "http://www.seattletimes.com/seattle-news/health/king-county-officials-patients-push-to-salvage-health-care-law/",
    "status": "progress",
    "date": "Jan. 20"
  },
  {
    "day": 4,
    "summary": "President Trump kicked off his first full week in office by signing three executive memorandums regarding the Trans-Pacific Partnership, a freeze on hiring for some federal government workers and a a ban on providing federal money to international groups that perform abortions or provide information about abortions.",
    "link": "Read more about the executive actions.",
    "url": "http://www.seattletimes.com/nation-world/nation-politics/trump-undoes-parts-of-obama-agenda-with-executive-actions/",
    "status": "progress",
    "date": "Jan. 23"
  },
  {
    "day": 4,
    "summary": "President Trump formally abandoned the Trans-Pacific Partnership.",
    "link": "Read more about what this means.",
    "url": "http://www.seattletimes.com/nation-world/trump-withdraws-us-from-sweeping-asia-trade-pact/",
    "status": "complete",
    "date": "Jan. 23"
  },
  {
    "day": 5,
    "summary": "Trump signed executive actions to aggressively overhaul the country's energy policy, advancing the Keystone XL and Dakota Access pipeline projects.",
    "link": "Here are recent articles on the Dakota Access Pipeline to help you understand the conflict.",
    "url": "http://www.seattletimes.com/tag/dakota-access-pipeline/",
    "status": "complete",
    "date": "Jan. 24"
  },
  {
    "day": 6,
    "summary": "Trump signed executive actions to jumpstart construction of a U.S.-Mexico border wall and order cuts in federal grants for \"sanctuary cities.\"",
    "link": "Here's what Trump's action on sanctuary cities means for Seattle.",
    "url": "http://www.seattletimes.com/seattle-news/what-does-trumps-action-on-sanctuary-cities-mean-for-seattle-thats-up-for-debate/",
    "status": "progress",
    "date": "Jan. 25"
  },
  {
    "day": 6,
    "summary": "Pending congressional funding, an executive action by Trump would boost the number of border patrol agents and immigration officers.",
    "link": "Read more about Trump's sharp shift in U.S. policy.",
    "url": "http://www.seattletimes.com/nation-world/trumps-immigration-actions-mark-sharp-shift-in-us-policy/",
    "status": "progress",
    "date": "Jan. 25"
  },
  {
    "day": 8,
    "summary": "Trump signed a memorandum to conduct a 30-day readiness review .......",
    "url": "https://www.whitehouse.gov/the-press-office/2017/01/27/presidential-memorandum-rebuilding-us-armed-forces",
    "status": "progress",
    "date": "Jan. 27"
  },
  {
    "day": 8,
    "summary": "Trump signed an executive order barring all refugees from entering the country for 120 days, blocking Syrian refugees indefinitely and barring citizens from seven majority Muslim countries — Iran, Sudan, Syria, Yemen, Libya, Iraq and Somalia— from entering the United States for 90 days.",
    "link": "The order sparked protests throughout thte country the next day, including at Seattle-Tacoma International Airport.",
    "url": "http://www.seattletimes.com/seattle-news/politics/heres-what-happened-in-seattle-after-trumps-immigration-ban/",
    "status": "complete",
    "date": "Jan. 27"
  },
  {
    "day": 9,
    "summary": "President Trump signed an executive order banning administration officials from ever lobbying the U.S. on behalf of a foreign government and imposing a separate five-year ban on other lobbying.",
    "link": "Here's more on the lobbying ban.",
    "url": "http://www.seattletimes.com/business/trump-sets-tougher-restrictions-on-lobbying-by-officials/",
    "status": "complete",
    "date": "Jan. 28"
  },
  {
    "day": 11,
    "summary": "Trump signed an executive order aimed at significantly cutting regulations. White House officials are calling the directive a “one in, two out” plan. It requires government agencies requesting a new regulations to identify two regulations they will cut from their own departments. (AP caption)",
    "link": "Read the executive order here.",
    "url": "https://www.whitehouse.gov/the-press-office/2017/01/30/presidential-executive-order-reducing-regulation-and-controlling",
    "status": "progress",
    "date": "Jan. 30"
  },
  {
    "day": 12,
    "summary": "In a move to replace the late Justice Antonin Scalia on the Supreme Court, Trump nominated Neil Gorsuch to the seat.",
    "link": "Read more about Neil Gorsuch, a judge on the 10th Circuit Court of Appeals in Denver.",
    "url": "http://www.seattletimes.com/nation-world/trump-set-to-announce-nominee-for-supreme-court/",
    "status": "progress",
    "date": "Jan. 31"
  },
  {
    "day": 21,
    "summary": "Trump signs an executive order aimed at creating a \"Task Force on Crime Reduction and PublicSafety.\"",
    "link": "Read more about the task force the Attorney General has been directed to create.",
    "url": "https://www.whitehouse.gov/the-press-office/2017/02/09/presidential-executive-order-task-force-crime-reduction-and-public",
    "status": "progress",
    "date": "Feb. 9"
  },
  {
    "day": 21,
    "summary": "Trump signs an executive order directing the Attorney General to review and make recommendations on legislation to protect Federal, State, tribal and local law enforcement officers.",
    "link": "This would include \"defining new crimes of violence and establishing new mandatory minimum sentences for existing crimes.\"",
    "url": "https://www.whitehouse.gov/the-press-office/2017/02/09/presidential-executive-order-preventing-violence-against-federal-state",
    "status": "progress",
    "date": "Feb. 9"
  },
  {
    "day": 21,
    "summary": "Trump signs an executive order aimed at strengthening enforcement of Federal law against \"the illegal smuggling and trafficking of humans, drugs or other substances, wildlife, and weapons.\"",
    "link": "The order also covers corruption, cybercrime, fraud and more.",
    "url": "https://www.whitehouse.gov/the-press-office/2017/02/09/presidential-executive-order-enforcing-federal-law-respect-transnational",
    "status": "progress",
    "date": "Feb. 9"
  }
]