[
  {
    "goal": "Propose a Constitutional Amendment to impose term limits on all members of Congress",
    "day_completed": 1,
    "date_completed": "Jan. 1"
  },
  {
    "goal": "A hiring freeze on all federal employees to reduce federal workforce through attrition (exempting military, public safety, and public health)",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "A requirement that for every new federal regulation, two existing regulations must be eliminated",
    "in_progress": 2,
    "date_completed": "Jan. 1"
  },
  {
    "goal": "A 5 year-ban on White House and Congressional officials becoming lobbyists after they leave government service",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "A lifetime ban on White House officials lobbying on behalf of a foreign government",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "A complete ban on foreign lobbyists raising money for American elections",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Renegotiate NAFTA or withdraw from the deal under Article 2205",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Withdrawal from the Trans-Pacific Partnership",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Direct my Secretary of the Treasury to label China a currency manipulator",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Direct the Secretary of Commerce and U.S. Trade Representative to identify all foreign trading abuses that unfairly impact American workers and direct them to use every tool under American and international law to end those abuses immediately",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Lift the restrictions on the production of $50 trillion dollars' worth of job-producing American energy reserves, including shale, oil, natural gas and clean coal.",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "lift the Obama-Clinton roadblocks and allow vital energy infrastructure projects, like the Keystone Pipeline, to move forward",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "cancel billions in payments to U.N. climate change programs and use the money to fix America's water and environmental infrastructure",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "cancel every unconstitutional executive action, memorandum and order issued by President Obama",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "begin the process of selecting a replacement for Justice Scalia from one of the 20 judges on my list, who will uphold and defend the Constitution of the United States",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "cancel all federal funding to Sanctuary Cities",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "begin removing the more than 2 million criminal illegal immigrants from the country and cancel visas to foreign countries that won't take them back",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "suspend immigration from terror-prone regions where vetting cannot safely occur. All vetting of people coming into our country will be considered extreme vetting.",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Middle Class Tax Relief And Simplification Act.",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "End The Offshoring Act.",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "American Energy & Infrastructure Act.",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "School Choice And Education Opportunity Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Repeal and Replace Obamacare Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Affordable Childcare and Eldercare Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "End Illegal Immigration Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Restoring Community Safety Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Restoring National Security Act",
    "date_completed": "Jan. 1"
  },
  {
    "goal": "Clean up Corruption in Washington Act",
    "date_completed": "Jan. 1"
  }
]